Merge v2, move spec to docs/specs/, convert diagrams to mermaid
Co-authored-by: greghaynes <42657+greghaynes@users.noreply.github.com>
